example/rails/simplepay/app/controllers/home_controller.rb

  def index
    @order = Order.create!(
      price: (rand.round(6) * 1000).to_i * 1000
    )
---
INSERT INTO "orders" ("price", "created_at", "updated_at") VALUES (?, ?, ?)  [["price", "30000"], ["created_at", 2016-12-21 09:12:01 UTC], ["updated_at", 2016-12-21 09:12:01 UTC]]