example/rails/cable/app/controllers/chats_controller.rb

SELECT  `chats`.* FROM `chats` WHERE `chats`.`id` = 5 LIMIT 1
INSERT INTO `orders` (`order_id`, `created_at`, `updated_at`) VALUES ('94ee373', '2016-12-19 11:11:44', '2016-12-19 11:11:44')
---
  def generate_checkout_token
    chat = Chat.find(params[:id])

    order_id = "#{params[:id]}#{SecureRandom.hex(3)}"
    Order.create!(order_id: order_id)