example/rails/cable/app/controllers/pays_controller.rb

  def notify
    transaction_status = params["transaction_status"]
    fraud_status = params["fraud_status"]

    if transaction_status == "capture" && fraud_status == "accept"
      Order.find_by_order_id(params["order_id"]).update_attributes!(
        transaction_status: transaction_status
      )
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`order_id` = '94ee373' LIMIT 1
UPDATE `orders` SET `transaction_status` = 'capture', `updated_at` = '2016-12-19 11:19:13' WHERE `orders`.`id` = 1